Repository: josephgbr/cups
Catalog: translation/src/translation.po
Languages: pt_br

source: True if *variable* is greater than *value*.
pt_br: Verdadeiro se *variable* for maior que *value*.

source: What to Localize in a Template File
pt_br: O que localizar em um arquivo de modelo

source: Because HTML contains both markup (that generally is not localized) and text (which *is* localized), you should carefully avoid changing the markup unless it contains human-readable text. The following HTML examples show how to correctly localize template files:
pt_br: Como o HTML contém marcação (que geralmente não é localizada) e texto (que *é* localizado), você deve evitar cuidadosamente alterar a marcação, a menos que ela contenha texto legível por humanos. Os exemplos HTML a seguir mostram como localizar corretamente os arquivos de modelo:

source: CGI Programs
pt_br: Programas CGI

source: CUPS uses five CGI programs to manage the dynamic web interfaces:
pt_br: CUPS usa cinco programas CGI para gerenciar as interfaces web dinâmicas:

source: Each CGI program accepts standard form variables such as `OP` for the operation to perform, `PRINTER_NAME` for the printer or class name to operate on, `QUERY` for any search words,`FIRST` for the first class, job, or printer to display, and `ORDER` to control the order that classes, jobs, or printers are displayed.
pt_br: Cada programa CGI aceita variáveis padrão de formulário, como `OP` para executar a operação, `PRINTER_NAME` para a impressora ou o nome da classe para operar, `QUERY` para qualquer palavra de pesquisa, `FIRST` para a primeira classe, trabalho ou impressora para exibir e `ORDER` para controlar a ordem em que as classes, trabalhos ou impressoras são exibidas.

source: In addition, the `classes.cgi`, `jobs.cgi`, and `printers.cgi` programs support a `WHICH_JOBS` variable to control which jobs are displayed. Table 3 lists the supported values.
pt_br: Além disso, os programas `classes.cgi`, `jobs.cgi` e `printers.cgi` oferecem suporte a uma variável `WHICH_JOBS` para controlar quais trabalhos são exibidos. A tabela 3 lista os valores aos quais há suporte.

source: *Table 3: WHICH_JOBS Values*
pt_br: *Tabela 3: WHICH_JOBS Valores*

source: WHICH_JOBS Value
pt_br: Valor de WHICH_JOBS

source: Description
pt_br: Descrição

source: Show all jobs
pt_br: Mostra todos os trabalhos

source: Show completed jobs
pt_br: Mostra trabalhos finalizados

source: Show active jobs
pt_br: Mostra trabalhos ativos

source: The `admin.cgi` program handles all of the printer and class administration functions and is run for all direct accesses to the */admin* resource. For most operations it uses the `PRINTER_NAME` and `OP` form variables to specify the action requested. Table 4 shows the supported `OP` values.
pt_br: O programa `admin.cgi` lida com todas as funções de administração de impressora e classe e é executado para todos os acessos diretos ao recurso */admin*. Para a maioria das operações, ele usa as variáveis de formulário `PRINTER_NAME` e `OP` para especificar a ação solicitada. A tabela 4 mostra os valores aos quais `OP` possui suporte.

source: *Table 4: admin.cgi OP Values*
pt_br: *Table 4: Valores de OP do admin.cgi*

source: OP Value
pt_br: Valor de OP

source: Adds a new printer class.
pt_br: Adiciona uma nova classe de impressora

source: Adds a new printer.
pt_br: Adiciona uma nova impressora.

source: Configures the server.
pt_br: Configura o servidor.

source: Deletes a printer class. The form variable `CONFIRM` may be set to any value to bypass the confirmation page.
pt_br: Exclui uma classe de impressora. A variável de formulário `CONFIRM` pode ser configurada para qualquer valor para ignorar a página de confirmação.

source: Deletes a printer. The form variable `CONFIRM` may be set to any value to bypass the confirmation page.
pt_br: Exclui uma impressora. A variável de formulário `CONFIRM` pode ser configurada para qualquer valor para ignorar a página de confirmação.

source: Find new printers that have not yet been added.
pt_br: Localiza novas impressoras que ainda não foram adicionadas.

source: Modifies a printer class.
pt_br: Modifica uma classe de impressora.

source: Modifies a printer.
pt_br: Modifica uma impressora.

source: Redirects the web browser to the location referenced by the URL form variable.
pt_br: Redireciona o navegador web para a localização referenciada pela variável de formulário URL.

source: Sets the allowed users for a destination.
pt_br: Define os usuários permitidos para um destino.

source: Sets the default destination.
pt_br: Define o destino padrão.

source: Sets the default options for a printer.
pt_br: Define as opções padrões para uma impressora.

source: Sets the printer-is-shared attribute for a destination.
pt_br: Define o atributo printer-is-shared para um destino.

source: The `classes.cgi` program is responsible for listing class information, including jobs destined for that class. It is for all direct accesses to the */classes* resource and supports the optional form variables `OP` and `WHICH_JOBS`. If no form variables are supplied then the CGI lists all or a specific class and the active jobs on each class. Table 5 shows the supported `OP` values.
pt_br: O programa `classes.cgi` é responsável pela listagem de informações de classe, incluindo trabalhos destinados a essa classe. É para todos os acessos diretos ao recurso */classes* e oferece suporte às variáveis de formulário opcionais `OP` e `WHICH_JOBS`. Se nenhuma variável de formulário for fornecida, o CGI listará todas ou uma classe específica e os trabalhos ativos em cada classe. A tabela 5 mostra os valores aos quais `OP` possui suporte.

source: *Table 5: classes.cgi OP Values*
pt_br: *Table 5: Valores de OP do classes.cgi*

source: Start accepting jobs for a class.
pt_br: Começa a aceitar trabalhos de uma classe.

source: Cancel all jobs for a class.
pt_br: Cancela todos os trabalhos de uma classe.

source: Move all jobs to a different destination.
pt_br: Move todos os trabalhos para um destino diferente.

source: Print a PostScript test page.
pt_br: Imprime uma página de teste do PostScript.

source: Stop accepting jobs for a class.
pt_br: Para de aceitar trabalhos de uma classe.

source: Start processing jobs for a class.
pt_br: Começa a processar trabalhos de uma classe.

source: Stop processing jobs for a class.
pt_br: Para de processar trabalhos de uma classe.

source: The `help.cgi` program handles all of the on-line help functions and is run for all direct accesses to the */help* resource.
pt_br: O programa `help.cgi` lida com todas as funções de ajuda on-line e é executado para todos os acessos diretos ao recurso */help*.

source: The `jobs.cgi` program handles all of the job functions and is run for all direct accesses to the */jobs* resource. For most operations it uses the `JOB_ID`, `OP`, and `WHICH_JOBS` form variables to specify the action requested. Table 6 shows the supported `OP` values.
pt_br: O programa `jobs.cgi` lida com todas as funções do trabalho e é executado para todos os acessos diretos ao recurso */jobs*. Para a maioria das operações, ele usa as variáveis de formulário `JOB_ID`, `OP` e `WHICH_JOBS` para especificar a ação solicitada. A tabela 6 mostra os valores aos quais `OP` possui suporte.

source: *Table 6: jobs.cgi OP Values*
pt_br: *Tabela 6: Valores de OP do jobs.cgi*

source: Cancels a job.
pt_br: Cancela um trabalho.

source: Holds a job indefinitely.
pt_br: Retém um trabalho indefinidamente.

source: Moves a job to another destination.
pt_br: Move um trabalho para outro destino.

source: Releases a job for printing.
pt_br: Libera um trabalho para impressão.

source: Restarts/reprints a stopped, canceled, completed, or aborted print job.
pt_br: Reinicia/reimprime um trabalho de impressão parado, cancelado, finalizado ou abortado.

source: The `printers.cgi` program is responsible for listing printer information, including jobs destined for that printer. It is for all direct accesses to the */printers* resource and supports the optional form variables `OP` and `WHICH_JOBS`. If no form variables are supplied then the CGI lists all printers or a specific printer and the active jobs on that printer. Table 7 shows the supported `OP` values.
pt_br: O programa `printers.cgi` é responsável pela listagem de informações de impressora, incluindo trabalhos destinados a essa impressora. Ele serve para todos os acessos diretos ao recurso */printers* e oferece suporte às variáveis de formulário opcionais `OP` e `WHICH_JOBS`. Se nenhuma variável de formulário for fornecida, o CGI listará todas as impressoras ou uma impressora específica e os trabalhos ativos naquela impressora. A tabela 7 mostra os valores aos quais `OP` possui suporte.

source: *Table 7: printers.cgi OP Values*
pt_br: *Tabela 7: Valores de OP do printers.cgi*

source: Start accepting jobs for a printer.
pt_br: Começa a aceitar trabalhos para uma impressora.

source: Cancel all jobs for a printer.
pt_br: Cancela todos os trabalhos de uma impressora.

source: Clean the print heads.
pt_br: Limpa as cabeças de impressão.

source: Print a printer self-test page.
pt_br: Imprime a página de autoteste de uma impressora.

source: Stop accepting jobs for a printer.
pt_br: Para de aceitar trabalhos para uma impressora.

source: Start processing jobs for a printer.
pt_br: Começa a processar trabalhos de uma impressora.

source: Stop processing jobs for a printer.
pt_br: Para de processar trabalhos de uma impressora.
