Repository: josephgbr/cups
Catalog: translation/src/translation.po
Languages: pt_br

source: Translating and Customizing CUPS
pt_br: Traduzindo e Personalizando o CUPS

source: Thanks to its extensive use of templates, images, and message catalogs, CUPS can be easily translated (or customized!) to suit your needs. This help file will guide you through the CUPS localization files so you can get the most out of it.
pt_br: Graças ao uso extensivo de modelos, imagens e catálogos de mensagens, o CUPS pode ser facilmente traduzido (ou personalizado!) para atender às suas necessidades. Este arquivo de ajuda irá guiá-lo através dos arquivos de localização CUPS para que você possa aproveitar ao máximo.

source: Getting Started
pt_br: Primeiros passos

source: Start by downloading the CUPS source code from [www.cups.org](https://www.cups.org/). After you extract the files from the source archive (or clone the Git repository), you will want to copy the following files and directories:
pt_br: Comece baixando o código-fonte CUPS de [www.cups.org](https://www.cups.org/). Depois de extrair os arquivos do pacote fonte (ou clonar o repositório Git), você vai querer copiar os seguintes arquivos e diretórios:

source: *desktop/cups.desktop* - the GNOME/KDE desktop file pointing to the CUPS web interface
pt_br: *desktop/cups.desktop* - o arquivo desktop do GNOME/KDE apontando para a interface web do CUPS

source: *doc/index.html.in* - the web interface home page
pt_br: *doc/index.html.in* - a página inicial da interface web

source: *locale/cups.pot* - the message catalog
pt_br: *locale/cups.pot* - o catálogo de mensagens

source: *templates/*.tmpl* and *templates/header.tmpl.in* - the web interface template files
pt_br: *templates/*.tmpl* e *templates/header.tmpl.in* - os arquivos modelos da interface web

source: With the exception of the message catalogs and desktop file, localization files are placed in subdirectories under the *doc* and *templates* using the locale name. Locale names are either *ll* or *ll_CC* , where "ll" is the 2-letter language code and "CC" is the 2-letter country code. *CUPS does not currently use or support the newer *ll-region* syntax for locale names.*
pt_br: Com exceção dos catálogos de mensagens e do arquivo desktop, os arquivos de localização são colocados em subdiretórios sob doc e templates usando o nome da localidade. Os nomes das localidades são *ll* ou *ll_CC*, sendo "ll" o código de idioma de 2 letras e "CC" o código de país de 2 letras. *CUPS atualmente não usa nem oferece suporte à nova sintaxe ll-região para nomes de localidade.*

source: All non-image files must be encoded using the UTF-8 character set.
pt_br: Todos os arquivos não imagem devem ser codificados usando o conjunto de caracteres UTF-8.

source: Submitting a Translation for CUPS
pt_br: Enviando uma tradução para o CUPS

source: To submit a translation for inclusion in CUPS, translate the desktop file, all of the template files, the *index.html.in* file, and the message catalog. Place these files in the correct subdirectories in the CUPS source code archive and run the following command to create an archive with your files:
pt_br: Para enviar uma tradução para inclusão no CUPS, traduza o arquivo desktop, todos os arquivos de modelos, o arquivo *index.html.in* e o catálogo de mensagens. Coloque esses arquivos nos subdiretórios corretos no arquivo de código-fonte do CUPS e execute o seguinte comando para criar um arquivo com seus arquivos:

source: Replace "ll_CC" with the locale name for your translation. Once you have created the archive, go to the [CUPS project page](https://github.com/apple/cups) and submit a bug report, attaching the translation to the report.
pt_br: Substitua "ll_CC" pelo nome da localidade para sua tradução. Depois de criar o arquivo, acesse a [página do projeto CUPS](https://github.com/apple/cups) e submeta um relatório de erro, anexando a tradução ao relatório.

source: Alternately, you can clone the CUPS project on Github, make your changes, and submit a pull request from the same link.
pt_br: Alternativamente, você pode clonar o projeto CUPS no GitHub, fazer suas alterações e submeter uma pull request a partir do mesmo link.

source: The Desktop File
pt_br: O arquivo desktop

source: The *desktop/cups.desktop* file provides a link to the CUPS web interface from desktop environments such as GNOME and KDE. To translate this file, add two lines to the bottom with the `Name` and `Comment` keys:
pt_br: O arquivo *desktop/cups.desktop* fornece um link para a interface web do CUPS a partir de ambientes de desktop, como o GNOME e o KDE. Para traduzir este arquivo, adicione duas linhas na parte inferior com as chaves `Name` e `Comment`:

source: The Home Page
pt_br: A página inicial

source: The *index.html.in* file is a complete HTML file that is displayed when the user visits "http://localhost:631/". Edit the existing *doc/index.html.in* and save it in the *doc/ll_CC* subdirectory so that the configure script can generate it. After configuring, run "make install" in the *doc* subdirectory to test the new home page.
pt_br: O arquivo *index.html.in* é um arquivo HTML completo que é exibido quando o usuário visita "http://localhost:631/". Edite o *doc/index.html.in* existente e guarde-o no subdiretório *doc/ll_CC* para que o script *configure* possa instalá-lo. Após configurá-lo, execute "make install" no subdiretório *doc* para testar a nova página inicial.

source: Message Catalogs
pt_br: Catálogos de mensagens

source: CUPS message catalogs are GNU gettext ".po" text files that provide a list of localized message strings for the CUPS software. Message catalogs are named *cups_ll.po* or *cups_ll_CC.po* , where "ll" is the standard 2-letter abbreviation for the language and "CC" is the standard 2-letter abbreviation for the country.
pt_br: Os catálogos de mensagens do CUPS são arquivos de texto GNU gettext ".po" que fornecem uma lista de cadeias de mensagens (ou "strings") localizadas para o software CUPS. Os catálogos de mensagens são denominados *cups_ll.po* ou *cups_ll_CC.po*, sendo "ll" a abreviatura padrão de 2 letras para o idioma e "CC" é o padrão de 2 letras abreviatura para o país.

source: When translating a new message catalog, copy the *cups.pot* message catalog file in the *locale* subdirectory of the CUPS source code. For example, to start translating the message catalog to Canadian French, you would type the following commands:
pt_br: Ao traduzir um novo catálogo de mensagens, copie o arquivo de catálogo de mensagens *cups.pot* no subdiretório *locale* do código-fonte do CUPS. Por exemplo, para começar a traduzir o catálogo de mensagens para francês canadense, digite os seguintes comandos:

source: Alternatively, you can copy the existing *cups_fr.po* message catalog and then make any necessary changes.
pt_br: Alternativamente, você pode copiar o catálogo de mensagens existente *cups_fr.po* e então fazer quaisquer alterações necessárias.

source: Once you have make your copy of the file, edit it using your favorite text editor or translation program to translate the text to the desired language.
pt_br: Depois de ter feito a sua cópia do arquivo, edite-o usando seu editor de texto favorito ou programa de tradução para traduzir o texto para o idioma desejado.

source: Then validate your translation using the *locale/checkpo* utility:
pt_br: Em seguida, valide sua tradução usando o utilitário *locale/checkpo*:

source: After fixing any errors in your translation, add your locale to the `LANGUAGES` variable in the *Makedefs* file and run the "make install" command in the *locale* subdirectory to test the translation. *This variable is automatically updated when you run the configure script.*
pt_br: Depois de corrigir quaisquer erros na sua tradução, adicione a sua localidade à variável `LANGUAGES` no arquivo *Makedefs* e execute o comando "make install" no subdiretório *locale* para testar a tradução. *Essa variável é automaticamente atualizada quando você executa o script configure.*

source: Template Files
pt_br: Arquivos de modelo

source: The CUPS scheduler provides a web interface that can be used to do many common printing and administration tasks. The built-in web server supports localization of web pages through the use of subdirectories for each locale, e.g. "fr" for French, "de" for German, "fr_ca" for French in Canada, and so forth.
pt_br: O agendador CUPS fornece uma interface web que pode ser usada para fazer muitas tarefas comuns de impressão e administração. O servidor web incorporado oferece suporte a localização de páginas web através do uso de subdiretórios para cada localidade, p.ex. "fr" para francês, "de" para alemão, "fr_ca" para francês no Canadá, e assim por diante.

source: Template files are HTML files with special formatting characters in them that allow substitution of variables and arrays. The CUPS CGI programs (`admin.cgi`, `classes.cgi`, `help.cgi`, `jobs.cgi`, and `printers.cgi`) use these template file to provide dynamic content for the web interface. Template files are installed in the */usr/share/cups/templates* directory by default. [Table 1](table1) lists the various template files and their purpose.
pt_br: Os arquivos de modelo são arquivos HTML com caracteres de formatação especial neles que permitem a substituição de variáveis e arrays. Os programas CGI do CUPS (`admin.cgi`, `classes.cgi`, `help.cgi`, `jobs.cgi` e `printers.cgi`) usam esses arquivos de modelo para fornecer conteúdo dinâmico para a interface da web. Os arquivos de modelo são instalados no diretório */usr/share/cups/templates* por padrão. A [tabela 1](table1) lista os vários arquivos de modelo e sua finalidade.

source: Translated versions of the template files should be saved in the *templates/ll_CC* subdirectory. For example, Canadian French template files should be saved in the *templates/fr_CA* subdirectory. After you have translated all of the templates, add the locale to the `LANGUAGES` variable in the *Makedefs* file and run "make install" in the *templates* subdirectory to test the translation.
pt_br: As versões traduzidas dos arquivos de modelo devem ser salvas no subdiretório *templates/ll_CC*. Por exemplo, os arquivos de modelo de francês canadense devem ser salvos no subdiretório *templates/fr_CA*. Depois de ter traduzido todos os modelos, adicione a localidade à variável `LANGUAGES` no arquivo *Makedefs* e execute "make install" no subdiretório *templates* para testar a tradução.

source: *Table 1: Web Interface Template Files*
pt_br: *Tabela 1: Arquivos de modelo da interface web*

source: Filename
pt_br: Nome de arquivo

source: Purpose
pt_br: Propósito

source: This is the initial form that is shown to add a new printer class.
pt_br: Esse é o formulário inicial que é mostrado para adicionar uma nova classe de impressora.

source: This is the initial form that is shown to add a new printer.
pt_br: Esse é o formulário inicial que é mostrado para adicionar uma nova impressora.

source: This is the main administration page.
pt_br: Essa é a página principal de administração.

source: This is the form that shows the list of available devices.
pt_br: Esse é o formulário que mostra a lista de dispositivos disponíveis.

source: This is the form that shows the list of available manufacturers.
pt_br: Esse é o formulário que mostra a lista de fabricantes disponíveis.

source: This is the form that shows the list of available printer models/drivers.
pt_br: Esse é o formulário que mostra a lista de modelos/drivers disponíveis.

source: This is the form that allows the user to choose a serial port and any options.
pt_br: Esse é o formulário que permite que o usuário escolha uma porta serial e quaisquer opções.

source: This is the form that allows the user to enter a device URI for network printers.
pt_br: Esse é o formulário que permite que o usuário insira a URI de um dispositivo para impressoras de rede.

source: This template shows information about a single class.
pt_br: Esse modelo mostra informações sobre uma única classe.

source: This template shows the "class added" message.
pt_br: Esse modelo mostra a mensagem "class added".

source: This is the template used to confirm the deletion of a class.
pt_br: Esse é o modelo usado para confirmar a exclusão de uma classe.

source: This template shows the "class deleted" message.
pt_br: Esse modelo mostra a mensagem "class deleted".

source: This template shows the "jobs" header for jobs in a class.
pt_br: Esse modelo mostra o cabeçalho "jobs" para trabalhos em uma classe.

source: This template shows the "class modified" message.
pt_br: Esse modelo mostra a mensagem "class modified".

source: This template shows one or more printer classes.
pt_br: Esse modelo mostra uma ou mais classes de impressora.

source: This template shows the "showing N of M classes" header in the class list.
pt_br: Esse modelo mostra o cabeçalho "showing N of M classes" na lista de classes.

source: This template shows the status of a command job.
pt_br: Esse modelo mostra o estado de um trabalho de comando.

source: This is the cupsd.conf editor page.
pt_br: Essa é a página do editor do cupsd.conf

source: This template displays a generic error message.
pt_br: Esse modelo exibe uma mensagem de erro genérico.

source: This is the "unknown operation" error page.
pt_br: Essa é a página de erro "unknown operation".

source: This template is used as the standard header on all dynamic content. Edit the *header.tmpl.in* file and let the configure script generate the *header.tmpl* file.
pt_br: Esse modelo é usado como o cabeçalho padrão em todos os conteúdos dinâmicos. Edite o arquivo *header.tmpl.in* e faça o script configure gerar o arquivo *header.tmpl*.

source: This is the top part of the help page.
pt_br: Essa é a parte superior da página de ajuda.

source: This is the standard page header for the printable version of help files.
pt_br: Essa é o cabeçalho da página padrão para a versão imprimível dos arquivos de ajuda.

source: This is the bottom part of the help page.
pt_br: Essa é a parte inferior da página de ajuda.

source: This template shows "job canceled".
pt_br: Esse modelo mostra "job canceled".

source: This template shows "job held".
pt_br: Esse modelo mostra "job held".

source: This template shows the move-job form.
pt_br: Essa mensagem mostra o formulário de movimento de trabalho.

source: This template shows "job moved".
pt_br: Esse modelo mostra "job moved".

source: This template shows "job released".
pt_br: Esse modelo mostra "job released".

source: This template shows "job reprinted".
pt_br: Esse modelo mostra "job reprinted".

source: This template is used to list the print jobs on a server, class, or printer.
pt_br: Esse modelo é usado para listar os trabalhos de impressão em um servidor, classe ou impressora.

source: This template shows the "showing N or M jobs" header in the jobs list.
pt_br: Esse modelo mostra o cabeçalho "showing N or M jobs" na lista de trabalhos.

source: This template shows a list of new printers that have been found.
pt_br: Esse modelo mostra uma lista de novas impressoras que foram encontradas.

source: This template is used as the first form when modifying a class.
pt_br: Esse modelo é usado como o primeiro formulário ao modificar uma classe.

source: This template is used as the first form when modifying a printer.
pt_br: Esse modelo é usado como o primeiro formulário ao modificar uma impressora.

source: This template shows "server not restarted because no changes were made to the configuration".
pt_br: Esse modelo mostra "server not restarted because no changes were made to the configuration".

source: This template is used to select a boolean PPD option.
pt_br: Esse modelo é usado para selecionar uma opção booleana de PPD.

source: This template shows the conflicting options.
pt_br: Esse modelo mostra as opções conflitantes.

source: This template is used to start a PPD option group.
pt_br: Esse modelo é usado para inciar um grupo de opções de PPD.

source: This template is used to select a multi-valued PPD option.
pt_br: Esse modelo é usado para selecionar uma opção multivalorada de PPD.

source: This template is used to select a single-valued PPD option.
pt_br: Esse modelo é usado para selecionar uma opção univalorada de PPD.

source: This template is used to end a PPD option group.
pt_br: Esse modelo é usado para terminar um grupo de opções de PPD.

source: This template shows the previous/next pager bar.
pt_br: Esse modelo mostra a barra de paginador anterior/seguinte.

source: This template shows information about a single printer.
pt_br: Esse modelo mostra informações sobre uma única impressora.

source: This template shows "printer now accepting jobs".
pt_br: Esse modelo mostra "printer now accepting jobs".

source: This template shows "printer added".
pt_br: Esse modelo mostra "printer added".

source: This template shows "All jobs on printer have been canceled."
pt_br: Esse modelo mostra "All jobs on printer have been canceled."

source: This template shows "printer configured".
pt_br: Esse modelo mostra "printer configured".

source: This template asks the user to confirm the deletion of a printer.
pt_br: Esse modelo pede que o usuário confirme a exclusão de uma impressora.

source: This template shows "default printer set".
pt_br: Esse modelo mostra "default printer set".

source: This template shows "printer deleted".
pt_br: Esse modelo mostra "printer deleted".

source: This templates shows the "jobs" header for jobs on a printer.
pt_br: Esse modelo mostra o cabeçalho "jobs" para trabalhos em uma impressora.

source: This template shows "printer modified".
pt_br: Esse modelo mostra "printer modified".

source: This template shows "printer now rejecting jobs".
pt_br: Esse modelo mostra "printer now rejecting jobs".

source: This template shows "printer started".
pt_br: Esse modelo mostra "printer started".

source: This template shows "printer stopped".
pt_br: Esse modelo mostra "printer stopped".

source: This template is used to list information on one or more printers.
pt_br: Esse modelo é usado para listar informações sobre uma ou mais impressoras.

source: This template shows the "showing printer N of M" header in the printers list.
pt_br: Esse modelo mostra o cabeçalho "showing printer N of M" na lista de impressoras.

source: This template shows "server restarting".
pt_br: Esse modelo mostra "server restarting".

source: This template shows the search form.
pt_br: Esse modelo mostra o formulário de pesquisa.

source: This template shows the first part of the set printer options form.
pt_br: Esse modelo mostra a primeira parte do formulário de opções de impressoras definidas.

source: This template shows the last part of the set printer options form.
pt_br: Esse modelo mostra a última parte do formulário de opções de impressoras definidas.

source: This template shows "test page printed".
pt_br: Esse modelo mostra "test page printed".

source: This template is used as the standard trailer on all dynamic content.
pt_br: Esse modelo é usado como o trailer padrão em todos os conteúdos dinâmicos.

source: This template shows the set allowed users form.
pt_br: Esse modelo mostra o formulário de usuários permitidos definidos.

source: Inserting Attributes and Values
pt_br: Inserindo atributos e valores

source: Template files consist of HTML with variable substitutions for named inside curly braces "{name}". Variable names are generally the IPP attribute names with the hyphen ("-") replaced by the underscore ("_") character. For example, the `job-printer-uri` attribute is renamed to `job_printer_uri`.
pt_br: Os arquivos de modelo consistem em HTML com substituições variáveis para o nome dentro de chaves "{name}". Nomes de variáveis geralmente são os nomes de atributo IPP com o hífen ("-") substituído pelo caractere de sublinhado ("_"). Por exemplo, o atributo `job-printer-uri` é renomeado para `job_printer_uri`.

source: Curley braces ("{" and "}") to indicate substitutions, and the backslash ("") character for quoting. To insert any of these special characters as-is you need to use the HTML `&name;` mechanism or prefix each special character with the backslash ("".)
pt_br: Chaves ("{" e "}") indicam substituições e o caractere de barra invertida ("\\") coloca entre aspas. Para inserir qualquer um desses caracteres especiais, pois é necessário usar o mecanismo HTML `&name;` ou prefixar cada caractere especial com a barra invertida ("\\").

source: You substitute the value of a variable using `{NAME}` in your template file. If the variable is undefined then the `{NAME}` string is output as-is.
pt_br: Você substitui o valor de uma variável usando `{NAME}` no seu arquivo de modelo. Se a variável estiver indefinida, a string `{NAME}` será emitida como está.

source: To substitute an empty string if the variable is undefined, use `{?NAME}` instead.
pt_br: Para substituir uma string vazia se a variável estiver indefinida, use `{?NAME}`.

source: Array Substitutions
pt_br: Substituições de array

source: The number of array elements can be inserted using `{#NAME}`. If the array is undefined then 0 is output. The current array element (starting at 1) is inserted with `{#}`.
pt_br: O número de elementos da matriz pode ser inserido usando `{#NAME}`. Se a matriz estiver indefinida, então será emitido 0. O elemento de matriz atual (começando em 1) é inserido com `{#}`.

source: Arrays are handled using `{[NAME]` at the beginning of a section and `}` at the end. The information between the closing bracket ("]") and closing brace ("}") is repeated for as many elements as are in the named array. For example, the following template will display a list of each job in the `job_id` array:
pt_br: As matrizes são tratadas usando `{[NAME]` no início de uma seção e `}` no final. A informação entre o colchete de fechamento ("]") e a chave de fechamento ("}") é repetida para tantos elementos quanto disponíveis na matriz designada. Por exemplo, o seguinte modelo exibirá uma lista de cada trabalho na matriz `job_id`:

source: Arrays can be nested, however all elements within the curly braces ("{" and "}") are indexed using the innermost array.
pt_br: Matrizes podem ser aninhadas, porém todos os elementos dentro das chaves ("{" and "}") são indexadas usando a matriz mais interna.

source: Conditional Tests
pt_br: Testes condicionais

source: Templates can also test variables against specific values and conditionally include text in the template. The format is:
pt_br: Os modelos também podem testar variáveis em relação a valores específicos e incluir condicionalmente texto no modelo. O formato é:

source: where *true* is the text that is included if the condition is true and *false* is the text that is included if the condition is false. A value of `#` is replaced with the current element number (starting at 1.) The character after the variable name specifies the condition to test. Table 2 shows the available test conditions.
pt_br: onde *true* é o texto que é incluído se a condição for verdadeira e *false* é o texto que é incluído se a condição for falsa. Um valor de `#` é substituído com o número de elemento atual (iniciando com 1). O caractere após o nome da variável especifica a condição para testar. A tabela 2 mostra as configurações de teste disponíveis.

source: *Table 2: Template Substitution Conditions*
pt_br: *Tabela 2: Condições de substituição de modelo*

source: Char
pt_br: Caractere

source: Condition
pt_br: Condição

source: True if *variable* exists.
pt_br: Verdadeiro se *variable* existir.

source: True if *variable* is equal to *value*.
pt_br: Verdadeiro se *variable* for igual a *value*.

source: True if *variable* is not equal to *value*.
pt_br: Verdadeiro se *variable* não for igual a *value*.

source: True if *variable* is less than *value*.
pt_br: Verdadeiro se *variable* for menor que *value*.
