Repository: josephgbr/cups
Catalog: guide/src/translation.po
Languages: pt_br

source: Templates can also test variables against specific values and conditionally include text in the template. The format is:
pt_br: Os modelos também podem testar variáveis em relação a valores específicos e incluir condicionalmente texto no modelo. O formato é:

source: {<i>variable</i>?<i>true</i>:<i>false</i>} {<i>variable</i>=<i>value</i>?<i>true</i>:<i>false</i>} {<i>variable</i>!<i>value</i>?<i>true</i>:<i>false</i>} {<i>variable</i><<i>value</i>?<i>true</i>:<i>false</i>} {<i>variable</i>><i>value</i>?<i>true</i>:<i>false</i>}
pt_br: {<i>variável</i>?<i>verdadeiro</i>:<i>falso</i>} {<i>variável</i>=<i>valor</i>?<i>verdadeiro</i>:<i>falso</i>} {<i>variável</i>!<i>valor</i>?<i>verdadeiro</i>:<i>falso</i>} {<i>variável</i><<i>valor</i>?<i>verdadeiro</i>:<i>falso</i>} {<i>variável</i>><i>valor</i>?<i>verdadeiro</i>:<i>falso</i>}

source: where <var>true</var> is the text that is included if the condition is true and <var>false</var> is the text that is included if the condition is false. A value of <code>#</code> is replaced with the current element number (starting at 1.) The character after the variable name specifies the condition to test. Table 3 shows the available test conditions.
pt_br: sendo <var>verdadeiro</var> o texto que é incluído se a condição for verdadeira e <var>falso</var> o texto que é incluído se a condição for falsa. Um valor de <code>#</code> é substituído com o número de elemento atual (iniciando com 1). O caractere após o nome da variável especifica a condição para testar. A Tabela 3 mostra as configurações de teste disponíveis.

source: Template Substitution Conditions
pt_br: Condições de substituição de modelo

source: Table 3: Template Substitution Conditions
pt_br: Tabela 3: Condições de substituição de modelo

source: Char
pt_br: Caractere

source: Condition
pt_br: Condição

source: True if <var>variable</var> exists.
pt_br: Verdadeiro se <var>variável</var> existir.

source: True if <var>variable</var> is equal to <var>value</var>.
pt_br: Verdadeiro se <var>variável</var> for igual a <var>valor</var>.

source: True if <var>variable</var> is not equal to <var>value</var>.
pt_br: Verdadeiro se <var>variável</var> não for igual a <var>valor</var>.

source: True if <var>variable</var> is less than <var>value</var>.
pt_br: Verdadeiro se <var>variável</var> for menor que <var>valor</var>.

source: True if <var>variable</var> is greater than <var>value</var>.
pt_br: Verdadeiro se <var>variável</var> for maior que <var>valor</var>.

source: CGI Programs
pt_br: Programas CGI

source: CUPS uses five CGI programs to manage the dynamic web interfaces:
pt_br: CUPS usa cinco programas CGI para gerenciar as interfaces web dinâmicas:

source: Each CGI program accepts standard form variables such as <code>OP</code> for the operation to perform, <code>PRINTER_NAME</code> for the printer or class name to operate on, <code>QUERY</code> for any search words, <code>FIRST</code> for the first class, job, or printer to display, and <code>ORDER</code> to control the order that classes, jobs, or printers are displayed.
pt_br: Cada programa CGI aceita variáveis padrão de formulário, como <code>OP</code> para executar a operação, <code>PRINTER_NAME</code> para a impressora ou o nome da classe para operar, <code>QUERY</code> para qualquer palavra de pesquisa, <code>FIRST</code> para a primeira classe, trabalho ou impressora para exibição e <code>ORDER</code> para controlar a ordem em que as classes, trabalhos ou impressoras são exibidas.

source: In addition, the <code>classes.cgi</code>, <code>jobs.cgi</code>, and <code>printers.cgi</code> programs support a <code>WHICH_JOBS</code> variable to control which jobs are displayed. Table 4 lists the supported values.
pt_br: Além disso, os programas <code>classes.cgi</code>, <code>jobs.cgi</code> e <code>printers.cgi</code> oferecem suporte a uma variável <code>WHICH_JOBS</code> para controle de quais trabalhos são exibidos. A Tabela 4 lista os valores aos quais há suporte.

source: WHICH_JOBS Values
pt_br: Valores de WHICH_JOBS

source: Table 4: WHICH_JOBS Values
pt_br: Tabela 4: Valores de WHICH_JOBS

source: WHICH_JOBS Value
pt_br: Valor de WHICH_JOBS

# Translating and Customizing CUPS.html+html.body.div.table.thead.tr.th:596-2
source: Description
pt_br: Descrição

source: Show all jobs
pt_br: Mostra todos os trabalhos

source: Show completed jobs
pt_br: Mostra trabalhos finalizados

source: Show active jobs
pt_br: Mostra trabalhos ativos

source: The <code>admin.cgi</code> program handles all of the printer and class administration functions and is run for all direct accesses to the <var>/admin</var> resource. For most operations it uses the <code>PRINTER_NAME</code> and <code>OP</code> form variables to specify the action requested. Table 5 shows the supported <code>OP</code> values.
pt_br: O programa <code>admin.cgi</code> lida com todas as funções de administração de impressora e classe e é executado para todos os acessos diretos ao recurso <var>/admin</var>. Para a maioria das operações, usa as variáveis de formulário <code>PRINTER_NAME</code> e <code>OP</code> para especificar a ação solicitada. A Tabela 5 mostra os valores aos quais <code>OP</ code> possui suporte.

source: admin.cgi OP Values
pt_br: Valores de OP do admin.cgi

source: Table 5: admin.cgi OP Values
pt_br: Tabela 5: Valores de OP do admin.cgi

# Translating and Customizing CUPS.html+html.body.div.table.thead.tr.th:626-2
source: OP Value
pt_br: Valor OP

# Translating and Customizing CUPS.html+html.body.div.table.thead.tr.th:627-2
source: Description
pt_br: Descrição

source: Accepts jobs on the named destination.
pt_br: Aceita trabalhos na destino dada.

source: Adds a new printer class.
pt_br: Adiciona uma nova classe de impressora.

source: Adds a new printer.
pt_br: Adiciona uma nova impressora.

source: Configures the server.
pt_br: Configura o servidor.

source: Deletes a printer class. The form variable <code>CONFIRM</code> may be set to any value to bypass the confirmation page.
pt_br: Exclui uma classe de impressora. A variável de formulário <code>CONFIRM</code> pode ser configurada para qualquer valor para ignorar a página de confirmação.

source: Deletes a printer. The form variable <code>CONFIRM</code> may be set to any value to bypass the confirmation page.
pt_br: Exclui uma impressora. A variável de formulário <code>CONFIRM</code> pode ser configurada para qualquer valor para ignorar a página de confirmação.

source: Exports printers to Samba.
pt_br: Exporta impressoras para o Samba.

source: Find new printers that have not yet been added.
pt_br: Localiza novas impressoras que ainda não foram adicionadas.

source: Modifies a printer class.
pt_br: Modifica uma classe de impressora.

source: Modifies a printer.
pt_br: Modifica uma impressora.

source: Purges all jobs on the named destination.
pt_br: Apaga todos os trabalhos no destino dado.

source: Redirects the web browser to the location referenced by the URL form variable.
pt_br: Redireciona o navegador web para a localização referenciada pela variável de formulário URL.

source: Rejects new jobs on the named destination.
pt_br: Rejeita trabalhos na destino dada.

source: Sets the allowed users for a destination.
pt_br: Define os usuários permitidos para um destino.

source: Sets the default destination.
pt_br: Define o destino padrão

source: Sets the default options for a printer.
pt_br: Define as opções padrões para uma impressora.

source: Sets the printer-is-shared attribute for a destination.
pt_br: Define o atributo printer-is-shared para um destino.

source: Starts the named class.
pt_br: Inicia uma classe dada.

source: Starts the named printer.
pt_br: Inicia uma impressora dada.

source: Stops the named class.
pt_br: Interrompe uma classe dada.

source: Stops the named printer.
pt_br: Interrompe uma impressora dada.

source: The <code>classes.cgi</code> program is responsible for listing class information, including jobs destined for that class. It is for all direct accesses to the <var>/classes</var> resource and supports the optional form variables <code>OP</code> and <code>WHICH_JOBS</code>. If no form variables are supplied then the CGI lists all or a specific class and the active jobs on each class. Table 6 shows the supported <code>OP</code> values.
pt_br: O programa <code>classes.cgi</code> é responsável pela listagem de informações de classe, incluindo trabalhos destinados a essa classe. É para todos os acessos diretos ao recurso <var>/classes</var> e oferece suporte às variáveis de formulário opcionais <code>OP</code> e <code>WHICH_JOBS</code>. Se nenhuma variável de formulário for fornecida, o CGI listará toda ou uma classe específica e os trabalhos ativos em cada classe. A Tabela 6 mostra os valores aos quais <code>OP</code> possui suporte.

source: classes.cgi OP Values
pt_br: Valores de OP do classes.cgi

source: Table 6: classes.cgi OP Values
pt_br: Tabela 6: Valores de OP do classes.cgi

# Translating and Customizing CUPS.html+html.body.div.table.thead.tr.th:736-2
source: OP Value
pt_br: Valores OP

# Translating and Customizing CUPS.html+html.body.div.table.thead.tr.th:737-2
source: Description
pt_br: Descrição

source: Moves the jobs on this class to another destination.
pt_br: Move os trabalhos nesta classe para outro destino.

source: Prints the standard PostScript test page.
pt_br: Imprime a página de teste PostScript padrão.

source: The <code>help.cgi</code> program handles all of the on-line help functions and is run for all direct accesses to the <var>/help</var> resource.
pt_br: O programa <code>help.cgi</code> lida com todas as funções de ajuda on-line e é executado para todos os acessos diretos ao recurso <var>/help</var>.

source: The <code>jobs.cgi</code> program handles all of the job functions and is run for all direct accesses to the <var>/jobs</var> resource. For most operations it uses the <code>JOB_ID</code>, <code>OP</code>, and <code>WHICH_JOBS</code> form variables to specify the action requested. Table 7 shows the supported <code>OP</code> values.
pt_br: O programa <code>jobs.cgi</code> lida com todas as funções do trabalho e é executado para todos os acessos diretos ao recurso <var>/jobs</var>. Para a maioria das operações, usa as variáveis <code>JOB_ID</code>, <code>OP</code> e <code>WHICH_JOBS</code> para especificar a ação solicitada. A Tabela 7 mostra os valores aos quais <code>OP</code> possui suporte.

source: jobs.cgi OP Values
pt_br: Valores de OP do jobs.cgi

source: Table 7: jobs.cgi OP Values
pt_br: Tabela 7: Valores de OP do jobs.cgi

# Translating and Customizing CUPS.html+html.body.div.table.thead.tr.th:773-2
source: OP Value
pt_br: Valor OP

# Translating and Customizing CUPS.html+html.body.div.table.thead.tr.th:774-2
source: Description
pt_br: Descrição

source: Cancels a job.
pt_br: Cancela um trabalho.

source: Holds a job indefinitely.
pt_br: Retém um trabalho indefinidamente.

source: Moves a job to another destination.
pt_br: Move um trabalho para outro destino.

source: Releases a job for printing.
pt_br: Libera um trabalho para impressão.

source: Restarts/reprints a stopped, canceled, completed, or aborted print job.
pt_br: Reinicia/reimprime um trabalho de impressão parado, cancelado, finalizado ou abortado.

source: The <code>printers.cgi</code> program is responsible for listing printer information, including jobs destined for that printer. It is for all direct accesses to the <var>/printers</var> resource and supports the optional form variables <code>OP</code> and <code>WHICH_JOBS</code>. If no form variables are supplied then the CGI lists all printers or a specific printer and the active jobs on that printer. Table 8 shows the supported <code>OP</code> values.
pt_br: O programa <code>printers.cgi</code> é responsável pela listagem de informações de impressora, incluindo trabalhos destinados a essa impressora. É para todos os acessos diretos ao recurso <var>/printers</var> e oferece suporte às variáveis de formulário opcionais <code>OP</code> e <code>WHICH_JOBS</code>. Se nenhuma variável de formulário for fornecida, o CGI listará todas as impressoras ou uma impressora específica e os trabalhos ativos naquela impressora. A Tabela 8 mostra os valores aos quais <code>OP</code> possui suporte.

source: printers.cgi OP Values
pt_br: Valores de OP do printers.cgi

source: Table 8: printers.cgi OP Values
pt_br: Tabela 8: Valores de OP do printers.cgi

# Translating and Customizing CUPS.html+html.body.div.table.thead.tr.th:818-2
source: OP Value
pt_br: Valor OP

# Translating and Customizing CUPS.html+html.body.div.table.thead.tr.th:819-2
source: Description
pt_br: Descrição

source: Clean the print heads.
pt_br: Limpa as cabeças de impressão.

source: Move all jobs to a different destination.
pt_br: Move todos os trabalhos para um destino diferente.

source: Print a printer self-test page.
pt_br: Imprime uma página de autoteste da impressora.

source: Print a PostScript test page.
pt_br: Imprime uma página de teste PostScript.
