Repository: josephgbr/cups
Catalog: guide/src/translation.po
Languages: pt_br

# Translating and Customizing CUPS.html+html.head.title:4-2
source: Translating and Customizing CUPS
pt_br: Traduzindo e Personalizando o CUPS

# Translating and Customizing CUPS.html+html.body.h1:9-1
source: Translating and Customizing CUPS
pt_br: Traduzindo e Personalizando o CUPS

source: Thanks to its extensive use of templates, images, and message catalogs, CUPS can be easily translated (or customized!) to suit your needs. This help file will guide you through the CUPS localization files so you can get the most out of it.
pt_br: Graças ao uso extensivo de modelos, imagens e catálogos de mensagens, o CUPS pode ser facilmente traduzido (ou personalizado!) para atender às suas necessidades. Este arquivo de ajuda irá guiá-lo através dos arquivos de localização CUPS para que você possa aproveitar ao máximo.

source: Getting Started
pt_br: Primeiros passos

source: Start by downloading the CUPS source code from <a href="http://www.cups.org/software.php" target="_blank">www.cups.org</a>. After you extract the files from the source archive, you will want to copy the following files and directories:
pt_br: Comece baixando o código-fonte CUPS de <a href="http://www.cups.org/software.php" target="_blank">www.cups.org</a>. Depois de extrair os arquivos do pacote fonte, você vai querer copiar os seguintes arquivos e diretórios:

source: <var>desktop/cups.desktop</var> - the GNOME/KDE desktop file pointing to the CUPS web interface
pt_br: <var>desktop/cups.desktop</var> - o arquivo desktop do GNOME/KDE apontando para a interface web do CUPS

source: <var>doc/index.html</var> - the web interface home page
pt_br: <var>doc/index.html</var> - a página inicial da interface web

source: <var>locale/cups.pot</var> - the message catalog
pt_br: <var>locale/cups.pot</var> - o catálogo de mensagens

source: <var>templates/*.tmpl</var> - the web interface template files
pt_br: <var>templates/*.tmpl</var> - os arquivos modelos da interface web

source: With the exception of the message catalogs and desktop file, localization files are placed in subdirectories under the <var>doc</var> and <var>templates</var> using the locale name. Locale names are either <var>ll</var> or <var>ll_CC</var>, where "ll" is the 2-letter language code and "CC" is the 2-letter country code. <em>CUPS does not currently use or support the newer <var>ll-region</var> syntax for locale names.</em>
pt_br: Com exceção dos catálogos de mensagens e do arquivo desktop, os arquivos de localização são colocados em subdiretórios nos <var>doc</var> e <var>templates</var> usando o nome da localidade. Os nomes das localidades são <var>ll</var> ou <var>ll_CC</var>, sendo "ll" o código de idioma de 2 letras e "CC" o código de país de 2 letras. <em>CUPS atualmente não usa nem oferece suporte à nova sintaxe <var>ll-região</var> para nomes de localidade.</em>

source: All non-image files must be encoded using the UTF-8 character set.
pt_br: Todos os arquivos não imagem devem ser codificados usando o conjunto de caracteres UTF-8.

source: Submitting a Translation for CUPS
pt_br: Enviando uma tradução para o CUPS

source: To submit a translation for inclusion in CUPS, translate the desktop file, all of the template files, the <var>index.html.in</var> file, and the message catalog. Place these files in the correct subdirectories in the CUPS source code archive and run the following command to create an archive with your files:
pt_br: Para enviar uma tradução para inclusão no CUPS, traduza o arquivo desktop, todos os arquivos de modelos, o arquivo <var>index.html.in</var> e o catálogo de mensagens. Coloque esses arquivos nos subdiretórios corretos no arquivo de código-fonte do CUPS e execute o seguinte comando para criar um arquivo com seus arquivos:

source: Replace "ll_CC" with the locale name for your translation. Once you have created the archive, go to the <a href="http://www.cups.org/str.php" target="_blank">CUPS Bugs & Features</a> page and submit a bug report, attaching the translation to the report.
pt_br: Substitua "ll_CC" pelo nome da localidade para sua tradução. Depois de criar o arquivo, vá para a página <a href="http://www.cups.org/str.php" target="_blank">Bugs & Recursos do CUPS</a> e envie um relatório de erro, anexando a tradução ao relatório.

source: The Desktop File
pt_br: O arquivo desktop

source: The <var>desktop/cups.desktop</var> file provides a link to the CUPS web interface from desktop environments such as GNOME and KDE. To translate this file, add two lines to the bottom with the <tt>Name</tt> and <tt>Comment</tt> keys:
pt_br: O arquivo <var>desktop/cups.desktop</var> fornece um link para a interface web do CUPS a partir de ambientes de desktop, como o GNOME e o KDE. Para traduzir este arquivo, adicione duas linhas na parte inferior com as chaves <tt>Name</tt> e <tt>Comment</tt>:

source: Name[<i>ll_CC</i>]=<i>Translation of "Manage Printing"</i> Comment[<i>ll_CC</i>]=<i>Translation of "CUPS Web Interface"</i>
pt_br: Name[<i>ll_CC</i>]=<i>Tradução de "Manage Printing"</i> Comment[<i>ll_CC</i>]=<i>Tradução de "CUPS Web Interface"</i>

source: The Home Page
pt_br: A página inicial

source: The <var>index.html</var> file is a complete HTML file that is displayed when the user visits "http://localhost:631/". Edit the existing <var>doc/index.html</var> and save it in the <var>doc/ll_CC</var> subdirectory so that the makefile can install it. Run "make install" in the <var>doc</var> subdirectory to test the new home page.
pt_br: O arquivo <var>index.html</var> é um arquivo HTML completo que é exibido quando o usuário visita "http://localhost:631/". Edite o <var>doc/index.html</var> existente e guarde-o no subdiretório <var>doc/ll_CC</var> para que o Makefile possa instalá-lo. Execute "make install" no subdiretório <var>doc</var> para testar a nova página inicial.

source: Message Catalogs
pt_br: Catálogos de mensagens

source: CUPS message catalogs are GNU gettext ".po" text files that provide a list of localized message strings for the CUPS software. Message catalogs are named <var>cups_ll.po</var> or <var>cups_ll_CC.po</var>, where "ll" is the standard 2-letter abbreviation for the language and "CC" is the standard 2-letter abbreviation for the country.
pt_br: Os catálogos de mensagens do CUPS são arquivos de texto GNU gettext ".po" que fornecem uma lista de cadeias de mensagens localizadas para o software CUPS. Os catálogos de mensagens são denominados <var>cups_ll.po</var> ou <var>cups_ll_CC.po</var>, sendo "ll" a abreviatura padrão de 2 letras para o idioma e "CC" é o padrão de 2 letras abreviatura para o país.

source: When translating a new message catalog, copy the <var>cups.pot</var> message catalog file in the <var>locale</var> subdirectory of the CUPS source code. For example, to start translating the message catalog to Canadian French, you would type the following commands:
pt_br: Ao traduzir um novo catálogo de mensagens, copie o arquivo de catálogo de mensagens <var>cups.pot</var> no subdiretório <var>locale</var> do código-fonte do CUPS. Por exemplo, para começar a traduzir o catálogo de mensagens para francês canadense, digite os seguintes comandos:

source: Alternatively, you can copy the existing <var>cups_fr.po</var> message catalog and then make any necessary changes.
pt_br: Alternativamente, você pode copiar o catálogo de mensagens <var>cups_fr.po</var> existente e então fazer quaisquer alterações necessárias.

source: Once you have make your copy of the file, edit it using your favorite text editor or translation program to translate the text to the desired language.
pt_br: Depois de ter feito a sua cópia do arquivo, edite-o usando seu editor de texto favorito ou programa de tradução para traduzir o texto para o idioma desejado.

source: Then validate your translation using the <var>locale/checkpo</var> utility:
pt_br: Em seguida, valide sua tradução usando o utilitário <var>locale/checkpo</var>:

source: After fixing any errors in your translation, add your locale to the <code>LANGUAGES</code> variable in the <var>Makedefs</var> file and run the "make install" command in the <var>locale</var> subdirectory to test the translation.
pt_br: Depois de corrigir quaisquer erros na sua tradução, adicione a sua localidade à variável <code>LANGUAGES</code> no arquivo <var>Makedefs</var> e execute o comando "make install" no subdiretório <var>locale</var> para testar a tradução.

source: Template Files
pt_br: Arquivos modelos

source: The CUPS scheduler provides a web interface that can be used to do many common printing and administration tasks. The built-in web server supports localization of web pages through the use of subdirectories for each locale, e.g. "fr" for French, "de" for German, "fr_ca" for French in Canada, and so forth.
pt_br: O agendador CUPS fornece uma interface web que pode ser usada para fazer muitas tarefas comuns de impressão e administração. O servidor web incorporado oferece suporte a localização de páginas web através do uso de subdiretórios para cada localidade, p.ex. "fr" para francês, "de" para alemão, "fr_ca" para francês no Canadá, e assim por diante.

source: Template files are HTML files with special formatting characters in them that allow substitution of variables and arrays. The CUPS CGI programs (<code>admin.cgi</code>, <code>classes.cgi</code>, <code>help.cgi</code>, <code>jobs.cgi</code>, and <code>printers.cgi</code>) use these template file to provide dynamic content for the web interface. Template files are installed in the <var>/usr/share/cups/templates</var> directory by default. Table 2 lists the various template files and their purpose.
pt_br: Os arquivos de modelos são arquivos HTML com caracteres de formatação especial neles que permitem a substituição de variáveis e arrays. Os programas CGI do CUPS (<code>admin.cgi</code>, <code>classes.cgi</code>, <code>help.cgi</code>, <code>jobs.cgi</code> e <code>printers.cgi</code>) usam esses arquivos de modelo para fornecer conteúdo dinâmico para a interface da web. Os arquivos de modelo são instalados no diretório <var>/usr/share/cups/templates</var> por padrão. A tabela 2 lista os vários arquivos de modelo e sua finalidade.

source: Translated versions of the template files should be saved in the <var>templates/ll_CC</var> subdirectory. For example, Canadian French template files should be saved in the <var>templates/fr_CA</var> subdirectory. After you have translated all of the templates, add the locale to the <code>LANGUAGES</code> variable in the <var>Makedefs</var> file and run "make install" in the <var>templates</var> subdirectory to test the translation.
pt_br: As versões traduzidas dos arquivos de modelo devem ser salvas no subdiretório <var>templates/ll_CC</var>. Por exemplo, os arquivos de modelo canadense francês devem ser salvos no subdiretório <var>templates/fr_CA</var>. Depois de ter traduzido todos os modelos, adicione a localidade à variável <code>LANGUAGES</code> no <var>Makedefs</var> e execute "make install" nos <var>templates</var> subdiretório para testar a tradução.

source: Web Interface Template Files
pt_br: Arquivos modelos da interface web

source: Table 2: Web Interface Template Files
pt_br: Tabela 2: Arquivos modelos da interface web

source: Filename
pt_br: Nome de arquivo

source: Purpose
pt_br: Propósito

source: This is the initial form that is shown to add a new printer class.
pt_br: Essa é a forma inicial que é mostrada para adicionar uma nova classe de impressora.

source: This is the initial form that is shown to add a new printer.
pt_br: Essa é a forma inicial que é mostrada para adicionar uma nova impressora.

source: This is the form that is shown to add a new RSS subscription.
pt_br: Essa é a nova forma que é mostrada para adicionar uma nova inscrição RSS.

source: This is the main administration page.
pt_br: Essa é a página principal de administração.

source: This is the form that shows the list of available devices.
pt_br: Essa é a forma que mostra a lista de dispositivos disponíveis.

source: This is the form that shows the list of available manufacturers.
pt_br: Essa é a forma que mostra a lista de fabricantes disponíveis.

source: This is the form that shows the list of available printer models/drivers.
pt_br: Essa é a forma que mostra a lista de modelos/drivers disponíveis.

source: This is the form that allows the user to choose a serial port and any options.
pt_br: Essa é a forma que permite que o usuário escolha uma porta serial e quaisquer opções.

source: This is the form that allows the user to enter a device URI for network printers.
pt_br: Essa é a forma que permite que o usuário insira a URI de um dispositivo para impressoras de rede.

source: This template shows the "class added" message.
pt_br: Esse modelo mostra a mensagem "class added".

source: This is the template used to confirm the deletion of a class.
pt_br: Esse é o modelo usado para confirmar a exclusão de uma classe.

source: This template shows the "class deleted" message.
pt_br: Esse modelo mostra a mensagem "class deleted".

source: This template shows the "jobs" header for jobs in a class.
pt_br: Esse modelo mostra o cabeçalho "jobs" para trabalhos em uma classe.

source: This template shows the "class modified" message.
pt_br: Esse modelo mostra a mensagem "class modified".

source: This template shows one or more printer classes.
pt_br: Esse modelo mostra uma ou mais classes de impressora.

source: This template shows the "showing N of M classes" header in the class list.
pt_br: Esse modelo mostra o cabeçalho "showing N of M classes" na lista de classes.

source: This is the cupsd.conf editor page.
pt_br: Essa é a página do editor do cupsd.conf

source: This template displays a generic error message.
pt_br: Esse modelo exibe uma mensagem de erro genérico.

source: This is the "unknown operation" error page.
pt_br: Essa é a página de erro "operação desconhecida".

source: This template is used as the standard header on all dynamic content.
pt_br: Esse modelo é usado como o cabeçalho padrão em todos os conteúdos dinâmicos.

source: This is the top part of the help page.
pt_br: Essa é a parte superior da página de ajuda.

source: This is the standard page header for the printable version of help files.
pt_br: Essa é o cabeçalho da página padrão para a versão imprimível dos arquivos de ajuda.

source: This template shows "job canceled".
pt_br: Esse modelo mostra "job canceled".

source: This template shows "job held".
pt_br: Esse modelo mostra "job held".

source: This template shows the move-job form.
pt_br: Essa mensagem mostra a forma de movimento de trabalho.

source: This template shows "job moved".
pt_br: Esse modelo mostra "job moved".

source: This template shows "job released".
pt_br: Esse modelo mostra "job released".

source: This template shows "job reprinted".
pt_br: Esse modelo mostra "job reprinted".

source: This template is used to list the print jobs on a server, class, or printer.
pt_br: Esse modelo é usado para listas os trabalhos de impressão em um servidor, classe ou impressora.

source: This template shows the "showing N or M jobs" header in the jobs list.
pt_br: Esse modelo mostra o cabeçalho "mostrando N ou M trabalhos" na lista de trabalhos.

source: This template shows a list of new printers that have been found.
pt_br: Esse modelo mostra uma lista de novas impressoras que foram localizadas.

source: This template shows "maintenance commands sent".
pt_br: Esse modelo mostra "maintenance commands sent".

source: This template is used as the first form when modifying a class.
pt_br: Esse modelo é usado como a primeira forma ao modificar uma classe.

source: This template is used as the first form when modifying a printer.
pt_br: Esse modelo é usado como a primeira forma ao modificar uma impressora.

source: This template shows "server not restarted because no changes were made to the configuration".
pt_br: Esse modelo mostra "server not restarted because no changes were made to the configuration".

source: This template is used to select a boolean PPD option.
pt_br: Esse modelo é usado para selecionar uma opção booleana de PPD.

source: This template shows the conflicting options.
pt_br: Esse modelo mostra as opções conflitantes.

source: This template is used to start a PPD option group.
pt_br: Esse modelo é usado para inciar um grupo de opções PPD.

source: This template is used to select a multi-valued PPD option.
pt_br: Esse modelo é usado para selecionar uma opção multivalorada de PPD.

source: This template is used to select a single-valued PPD option.
pt_br: Esse modelo é usado para selecionar uma opção univalorada de PPD.

source: This template is used to end a PPD option group.
pt_br: Esse modelo é usado para terminar um grupo de opções PPD.

source: This template shows the previous/next pager bar.
pt_br: Esse modelo mostra a barra de paginador anterior/seguinte.

source: This template shows "printer now accepting jobs".
pt_br: Esse modelo mostra "printer now accepting jobs".

source: This template shows "printer added".
pt_br: Esse modelo mostra "printer added".

source: This template shows "printer configured".
pt_br: Esse modelo mostra "printer configured".

source: This template asks the user to confirm the deletion of a printer.
pt_br: Esse modelo pede que o usuário confirme a exclusão de uma impressora.

source: This template shows "default printer set".
pt_br: Esse modelo mostra "default printer set".

source: This template shows "printer deleted".
pt_br: Esse modelo mostra "printer deleted".

source: This templates shows the "jobs" header for jobs on a printer.
pt_br: Esse modelo mostra o cabeçalho "jobs" para trabalhos em uma impressora.

source: This template shows "printer modified".
pt_br: Esse modelo mostra "printer modified".

source: This template shows "printer has been purged of all jobs".
pt_br: Esse modelo mostra "printer has been purged of all jobs".

source: This template shows "printer now rejecting jobs".
pt_br: Esse modelo mostra "printer now rejecting jobs".

source: This template shows "printer started".
pt_br: Esse modelo mostra "printer started".

source: This template shows "printer stopped".
pt_br: Esse modelo mostra "printer stopped".

source: This template is used to list information on one or more printers.
pt_br: Esse modelo é usado para listar informações em uma ou mais impressoras.

source: This template shows the "showing printer N of M" header in the printers list.
pt_br: Esse modelo mostra o cabeçalho "showing printer N of M" na lista de impressoras.

source: This template shows "server restarting".
pt_br: Esse modelo mostra "server restarting".

source: This template shows the export printers to Samba form.
pt_br: Esse modelo mostra as impressoras de exportação para forma do Samba.

source: This template shows "printers exported to Samba".
pt_br: Esse modelo mostra "printers exported to Samba".

source: This template shows the search form.
pt_br: Essa mensagem mostra o formulário de pesquisa.

source: This template shows the first part of the set printer options form.
pt_br: Esse modelo mostra a primeira parte do formulário de opções de impressoras definidas.

source: This template shows the last part of the set printer options form.
pt_br: Esse modelo mostra a última parte do formulário de opções de impressoras definidas.

source: This template shows "subscription ... added".
pt_br: Esse modelo mostra "subscription ... added".

source: This template shows "subscription #NNN canceled".
pt_br: Esse modelo mostra "subscription #NNN canceled".

source: This template shows "test page printed".
pt_br: Esse modelo mostra "test page printed".

source: This template is used as the standard trailer on all dynamic content.
pt_br: Esse modelo é usado como o trailer padrão em todos os conteúdos dinâmicos.

source: This template shows the set allowed users form.
pt_br: Essa mensagem mostra o formulário de usuários permitidos definidos.

source: Inserting Attributes and Values
pt_br: Inserindo de atributos e valores

source: Template files consist of HTML with variable substitutions for named inside curly braces "{name}". Variable names are generally the IPP attribute names with the hyphen ("-") replaced by the underscore ("_") character. For example, the <tt>job-printer-uri</tt> attribute is renamed to <tt>job_printer_uri</tt>.
pt_br: Os arquivos de modelo consistem em HTML com substituições variáveis para o nome dentro de chaves "{name}". Nomes de variáveis geralmente são os nomes de atributo IPP com o hífen ("-") substituído pelo caractere de sublinhado ("_"). Por exemplo, o atributo <tt>job-printer-uri</tt> é renomeado para <tt>job_printer_uri</tt>.

source: Curley braces ("{" and "}") to indicate substitutions, and the backslash ("\") character for quoting. To insert any of these special characters as-is you need to use the HTML <code>&name;</code> mechanism or prefix each special character with the backslash ("\".)
pt_br: Chaves ("{" e "}") para indicar substituições e o caractere de barra invertida ("\") para colocar entre aspas. Para inserir qualquer um desses caracteres especiais, pois é necessário usar o mecanismo HTML <code>&name;</code> ou prefixar cada caractere especial com a barra invertida ("\").

source: You substitute the value of a variable using <code>{NAME}</code> in your template file. If the variable is undefined then the <code>{NAME}</code> string is output as-is.
pt_br: Você substitui o valor de uma variável usando <code>{NAME}</code> no seu arquivo de modelo. Se a variável estiver indefinida, a string <code>{NAME}</code> será emitida como está.

source: To substitute an empty string if the variable is undefined, use <code>{?NAME}</code> instead.
pt_br: Para substituir uma string vazia se a variável estiver indefinida, use <code>{?NAME}</code>.

source: Array Substitutions
pt_br: Substituições de matriz

source: The number of array elements can be inserted using <code>{#NAME}</code>. If the array is undefined then 0 is output. The current array element (starting at 1) is inserted with <code>{#}</code>.
pt_br: O número de elementos da matriz pode ser inserido usando <code>{#NAME}</ code>. Se a matriz estiver indefinida, então será emitido 0. O elemento de matriz atual (começando em 1) é inserido com <code>{#}</code>.

source: Arrays are handled using <code>{[NAME]</code> at the beginning of a section and <code>}</code> at the end. The information between the closing bracket ("]") and closing brace ("}") is repeated for as many elements as are in the named array. For example, the following template will display a list of each job in the <code>job_id</code> array:
pt_br: As matrizes são tratadas usando <code>{[NAME]</code> no início de uma seção e <code>}</code> no final. A informação entre o colchete de fechamento ("]") e a chave de fechamento ("}") é repetida para tantos elementos quanto disponíveis na matriz designada. Por exemplo, o seguinte modelo exibirá uma lista de cada trabalho na matriz <code>job_id</code>:

source: <TR> <TH>Job ID</TH> <TH>Destination</TH> <TH>Title</TH> </TR> {[job_id] <TR> <TD>{?job_id}</TD> <TD>{?job_printer_name}</TD> <TD>{?job_name}</TD> </TR> }
pt_br: <TR> <TH>Job ID</TH> <TH>Destino</TH> <TH>Título</TH> </TR> {[job_id] <TR> <TD>{?job_id}</TD> <TD>{?job_printer_name}</TD> <TD>{?job_name}</TD> </TR> }

source: Arrays can be nested, however all elements within the curly braces ("{" and "}") are indexed using the innermost array.
pt_br: Matrizes podem ser aninhadas, porém todos os elementos dentro das chaves ("{" and "}") são indexadas usando a matriz mais interna.

source: Conditional Tests
pt_br: Testes condicionais
